<template>
  <div>
    <div class="containers">
      <!-- 效果一 -->
      <div class="bd_index one">
        <div class="neirong">
          <strong>
            <h1>link everything</h1>
          </strong>
          <p>用RSS连接全世界</p>
        </div>
      </div>
    </div>
    <div class="searchBar"
         id="searchBar">
      <div class="tab"
           :class="searchBarFixed == true ? 'isFixed' :''">

        <div class="tab-item">

          <router-link to="/main/goods"
                       active-class="active"> <svg t="1569211600286" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5233" width="20" height="20"><path d="M973.66 1024h-17.324V17.324H67.664V1024H50.34V8.662A8.66 8.66 0 0 1 59.002 0h905.996a8.66 8.66 0 0 1 8.662 8.662V1024z" fill="#4A555F" p-id="5234"></path><path d="M841.184 248.298H182.82a8.66 8.66 0 0 1-8.662-8.662V119.944a8.66 8.66 0 0 1 8.662-8.662h658.364a8.66 8.66 0 0 1 8.662 8.662v119.692a8.664 8.664 0 0 1-8.662 8.662z m-649.702-17.324h641.04V128.606H191.482v102.368z" fill="#4A555F" p-id="5235"></path><path d="M211.692 148.816h600.618v61.948H211.692z" fill="#FFD452" p-id="5236"></path><path d="M774.15 662.71H559.566a8.66 8.66 0 0 1-8.662-8.662v-82.576a8.664 8.664 0 0 1 8.662-8.662h40.016l-87.596-85.002-87.602 85.002h40.078a8.66 8.66 0 0 1 8.662 8.662v82.576a8.66 8.66 0 0 1-8.662 8.662H249.878c-41.744 0-75.704-33.962-75.704-75.706v-183.226c0-41.744 33.96-75.704 75.704-75.704h524.272c41.748 0 75.706 33.96 75.706 75.704v183.226c0 41.744-33.958 75.706-75.706 75.706z m-205.922-17.324h205.922c32.194 0 58.382-26.192 58.382-58.382v-183.226c0-32.192-26.188-58.38-58.382-58.38H249.878c-32.192 0-58.38 26.188-58.38 58.38v183.226c0 32.192 26.188 58.382 58.38 58.382H455.8v-65.252h-52.78a8.664 8.664 0 0 1-6.032-14.88l108.966-105.736a8.66 8.66 0 0 1 12.062 0l108.966 105.736a8.664 8.664 0 1 1-6.034 14.88h-52.722v65.252z" fill="#4A555F" p-id="5237"></path><path d="M588.44 625.174v-24.83h103.722l-180.176-174.84-180.182 174.84h103.784v24.83h-185.71c-21.046 0-38.17-17.124-38.17-38.172V403.78c0-21.048 17.124-38.172 38.17-38.172h524.272c21.046 0 38.172 17.124 38.172 38.172v183.224c0 21.048-17.126 38.172-38.172 38.172H588.44z" fill="#F58E6F" p-id="5238"></path><path d="M559.562 745.206H464.44a8.66 8.66 0 0 1-8.662-8.662v-156.39h-52.736a8.66 8.66 0 0 1-6.034-14.876l108.958-105.76a8.656 8.656 0 0 1 12.068 0l108.96 105.76a8.654 8.654 0 0 1 1.99 9.468 8.66 8.66 0 0 1-8.024 5.408h-52.738v156.39a8.66 8.66 0 0 1-8.66 8.662z m-86.462-17.324h77.798v-156.39a8.664 8.664 0 0 1 8.662-8.662h40.04L512 477.802l-87.596 85.028h40.036a8.66 8.66 0 0 1 8.662 8.662v156.39z" fill="#4A555F" p-id="5239"></path><path d="M493.312 707.67V542.62h-19.07L512 505.97l37.76 36.65h-19.072v165.05z" fill="#71CCE0" p-id="5240"></path><path d="M182.82 831.372h658.364v17.324H182.82zM182.82 955.216h658.364v17.324H182.82zM182.82 1001.184h658.364v17.324H182.82z" fill="#4A555F" p-id="5241"></path></svg>订阅</router-link>
        </div>
        <div class="tab-item">
          <router-link to="/main/ratings"
                       active-class="active"><svg t="1569211565723" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4414" width="20" height="20"><path d="M512 93.098667A418.901333 418.901333 0 0 0 101.461333 595.825778a46.535111 46.535111 0 0 1-91.221333 18.517333C3.413333 580.664889 0 546.360889 0 512 0 229.262222 229.262222 0 512 0c96.341333 0 186.652444 26.680889 263.623111 73.016889 36.266667-21.902222 69.888-38.769778 99.157333-48.583111 17.863111-6.001778 36.693333-10.24 54.784-10.012445 18.375111 0.227556 40.305778 5.262222 57.514667 22.471111 17.237333 17.237333 22.272 39.168 22.471111 57.543112 0.256 18.119111-3.982222 36.920889-9.984 54.840888-9.784889 29.212444-26.680889 62.833778-48.583111 99.100445A509.809778 509.809778 0 0 1 1024 512c0 282.737778-229.262222 512-512 512-96.341333 0-186.652444-26.680889-263.623111-73.016889-36.266667 21.902222-69.888 38.769778-99.157333 48.583111-17.863111 6.001778-36.693333 10.24-54.784 10.012445-18.346667-0.227556-40.305778-5.262222-57.514667-22.471111-17.237333-17.237333-22.272-39.168-22.471111-57.543112-0.256-18.147556 3.982222-36.920889 9.984-54.840888 12.117333-35.982222 34.872889-78.648889 64.597333-124.700445 65.706667-101.603556 172.373333-230.115556 301.624889-359.367111 104.220444-104.220444 207.872-193.678222 297.415111-258.872889A417.194667 417.194667 0 0 0 512 93.098667z m392.334222 19.598222c-25.287111 8.448-60.359111 26.510222-103.765333 54.528-94.464 61.070222-217.827556 163.015111-344.092445 289.251555-126.236444 126.293333-228.181333 249.656889-289.251555 344.092445-28.017778 43.406222-46.08 78.506667-54.528 103.765333-1.223111 3.697778-2.190222 7.025778-2.929778 9.898667 2.872889-0.739556 6.172444-1.706667 9.898667-2.958222 25.287111-8.419556 60.359111-26.481778 103.765333-54.471111a46.535111 46.535111 0 0 1 51.655111 0.711111A416.768 416.768 0 0 0 512 930.901333c231.367111 0 418.901333-187.534222 418.901333-418.901333a416.768 416.768 0 0 0-73.386666-236.942222 46.535111 46.535111 0 0 1-0.739556-51.626667c28.017778-43.406222 46.08-78.506667 54.528-103.765333 1.223111-3.697778 2.190222-7.025778 2.929778-9.898667a142.791111 142.791111 0 0 0-9.898667 2.929778z" fill="#000000" p-id="4415"></path><path d="M583.111111 601.400889a67.043556 67.043556 0 1 0 0 134.087111 67.043556 67.043556 0 0 0 0-134.087111zM426.666667 668.444444a156.444444 156.444444 0 1 1 312.888889 0 156.444444 156.444444 0 0 1-312.888889 0z" fill="#000000" p-id="4416"></path></svg>发现</router-link>
        </div>
        <div class="tab-item">
          <router-link to="/main/seller"
                       active-class="active"><svg t="1569210258145" class="icon" <svg t="1569211308565" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3480" width="20" height="20"><path d="M682.9 328c0-37.8-12.3-72.7-33.1-101 6.5 38.2-22.6 103.5-78.3 159.3-56.1 56.1-124.5 82.5-161.4 76.7 28.6 21.9 64.3 34.9 103 34.9 93.6 0 169.8-76.2 169.8-169.9z" fill="#FFD524" p-id="3481"></path><path d="M513.1 556.8c126.2 0 228.8-102.6 228.8-228.8 0-117.9-88.3-215.7-205.5-227.6-16.2-1.6-30.7 10.1-32.3 26.3-1.6 16.2 10.1 30.7 26.3 32.3 49.4 5 91.9 30.7 119.3 68 20.9 28.3 33.1 63.3 33.1 101 0 93.7-76.2 169.9-169.9 169.9-38.7 0-74.4-13-103-34.9-40.6-31.1-66.9-80-66.9-135 0-31.4 8.6-62.1 24.9-88.7 8.5-13.9 4.2-32-9.7-40.5-13.9-8.5-32-4.1-40.5 9.7-22 35.9-33.6 77.2-33.6 119.5 0.2 126.2 102.8 228.8 229 228.8z" fill="#333333" p-id="3482"></path><path d="M419.5 181.5c4.7 0 9.4-1.1 13.8-3.5 3.2-1.7 6.4-3.3 9.6-4.7 14.8-6.7 21.4-24.2 14.7-39-6.7-14.8-24.2-21.4-39-14.7-4.4 2-8.7 4.1-13 6.4-14.4 7.6-19.8 25.5-12.2 39.9 5.4 9.9 15.6 15.6 26.1 15.6zM958.2 885.4C887.9 707.8 709 588.6 513.1 588.6c-196.1 0-375 119.4-445.2 297.1-6 15.1 1.4 32.3 16.6 38.2 3.6 1.4 7.2 2.1 10.8 2.1 11.7 0 22.8-7.1 27.4-18.7C184 751.9 340.9 647.5 513.1 647.5c172 0 328.9 104.3 390.3 259.6 6 15.1 23.2 22.5 38.3 16.6 15.1-6.1 22.5-23.2 16.5-38.3z" fill="#333333" p-id="3483"></path></svg>我的</router-link>
        </div>
      </div>
    </div>
    <keep-alive>
      <router-view active-class="active"></router-view>
    </keep-alive>
  </div>
</template>
<script>

export default {
  data () {
    return {
      searchBarFixed: true
    }
  },
  name: 'App',
  mounted () {
    window.addEventListener('scroll', this.handleScroll)
  },
  methods: {
    handleScroll () {
      let scrollTop = window.pageYOffset || document.documentElement.scrollTop || document.body.scrollTop
      let offsetTop = document.querySelector('#searchBar').offsetTop
      this.searchBarFixed = scrollTop > (offsetTop)
    },
    toggle (tabIndex) {
      this.whichTab = tabIndex
      window.location.href = '#searchBar' // 锚点
    }
  }
}
</script>
<style lang="stylus" rel="stylesheet/stylus"  >
@import url('../../common/stylus/main.css');
@import url('../../common/stylus/iconfont.css');

*, *:before, *:after {
  box-sizing: inherit;
}

body {
  background: #fafafa;
  color: #333;
  /* Sometimes fonts don't display optimally on all devices */
  -moz-osx-font-smoothing: grayscale;
  -webkit-font-smoothing: antialiased;
  text-rendering: optimizeLegibility;
  /* font-weight:300; */
}

a, .user {
  text-decoration: none;
  color: #88d;
}

a:hover {
  color: rgb(100, 197, 100);
}

a.button {
  display: inline-block;
  text-align: center;
  padding: 14px 24px;
  font-weight: 600;
  cursor: pointer;
  line-height: 1;
  background: #88d;
}

p, li, time {
  font-size: 1.6rem;
  line-height: 3.2rem;
  margin: 0 0 2.4rem;
}

#searchBar {
  .isFixed {
    width: 100%;
    position: fixed;
    background-color: #fff;
    top: 0px; // 44px是导航标题头的高度
    z-index: 965;
    padding: 0px;
    box-shadow: 1px 0.5px 1px 0.5px #555;
  }
}

.tab {
  margin-bottom: 10px;
  line-height: 50px;
  display: flex;
  border-1px(rgba(7, 17, 27, 0.1));
  background: hsla(0, 0, 100%, 0.16);

  .tab-item {
    margin-top: 1px;
    flex: 1;
    font-size: 14px;
    color: rgb(77, 85, 93);
    text-align: center;
    span {
      display: block;
    }

    .active {
      color: red;
    }
  }
}

.containers {
  width: 100%;
  height: 100%;
  position: relative;
  z-index: 1;
}

.bd_index {
  position: relative;
  z-index: 1;
  width: 100%;
  height: 500px;
  background: url('../../../static/drawable/zg.jpg') no-repeat center center; // hbimg.huabanimg.com/344c7e6763ac3ac6a516a0e96c9acf1315b0c8702a6c5-rwyZan_fw658) no-repeat center center;
  background-size: cover;
  background-attachment: fixed;
}

.neirong {
  position: relative;
  top: 90%;
  margin: 0 auto;
  font-size: 22px;
  color: #fff;
  box-sizing: border-box;
  padding-left: 40px;
}

@media screen and (max-width: 960px) {
  .bd_index {
    width: 100%;
    height: 20%;
  }
}
</style>
